# =============================================================================
# Homebrew Brewfile
# Remote macOS Agents - Tools Installation
# =============================================================================
# Run: brew bundle --file=/path/to/Brewfile
# =============================================================================

# =============================================================================
# CLI Tools (formulas)
# =============================================================================

# Core Version Control
brew "git"
brew "gh"

# Shell & Prompt
brew "starship"
brew "chezmoi"

# Editor
brew "neovim"

# Runtime Managers
brew "mise"
brew "fvm"
brew "pnpm"

# Database
brew "postgresql@17"
brew "supabase"

# Mobile Development
brew "cocoapods"

# Development Tools
brew "lazygit"
brew "jq"
brew "yq"
brew "tldr"
brew "bat"
brew "eza"
brew "fd"
brew "ripgrep"
brew "go"

# Image/Media
brew "imagemagick"
brew "ffmpeg"

# System Utilities
brew "tree"
brew "htop"
brew "watch"
brew "parallel"
brew "shellcheck"
brew "shfmt"
brew "hadolint"

# =============================================================================
# GUI Applications (casks)
# =============================================================================

# Terminal & Fonts
cask "font-fira-code-nerd-font"
cask "cmux"

# Password Manager & VPN
cask "1password"
cask "1password-cli"
cask "tailscale"

# Productivity
cask "notion"
cask "raycast"
cask "setapp"

# Development IDEs
cask "cursor"
cask "claude"
cask "bruno"
cask "gitkraken"
cask "datagrip"
cask "docker"
cask "docker-desktop"
cask "antigravity"
cask "antigravity-ide"

# BI & Data
cask "tableau"
cask "superset"

# Office
cask "microsoft-excel"

# Browser
cask "google-chrome"
