# =============================================================================
# Homebrew Brewfile
# Remote macOS Agents - Tools Installation
# =============================================================================
# Run: brew bundle --file=/path/to/Brewfile
# =============================================================================

# =============================================================================
# CLI Tools (formulas)
# =============================================================================

# Core Version Control
brew "git"
brew "gh"

# Shell & Prompt
brew "starship"
brew "zsh"
brew "zsh-completions"

# Editor
brew "neovim"
brew "macvim"

# Runtime Managers
brew "mise"
brew "fvm"
brew "uv"

# JavaScript/Node
brew "node"
brew "pnpm"

# Python
brew "python@3.12"
brew "pyenv"

# Database
brew "postgresql@17"
brew "psql"
brew "supabase"

# Mobile Development
brew "cocoapods"

# Development Tools
brew "lazygit"
brew "gg"
brew "httpie"
brew "jq"
brew "yq"
brew "tldr"
brew "bat"
brew "exa"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "delta"
brew "ghq"

# Build Tools
brew "cmake"
brew "go"
brew "rustup"

# Cloud CLI
brew "awscli"
brew "google-cloud-sdk"
brew "terraform"
brew "kubectl"
brew "helm"

# Network Tools
brew "wget"
brew "curl"
brew "nmap"
brew "mosh"

# Image/Media
brew "imagemagick"
brew "ffmpeg"
brew "gifsicle"

# System Utilities
brew "tree"
brew "htop"
brew "watch"
brew "parallel"
brew "shellcheck"
brew "shfmt"
brew "hadolint"
brew "tflint"

# Databases (extra)
brew "redis"
brew "mysql"
brew "sqlite"

# =============================================================================
# GUI Applications (casks)
# =============================================================================

# Terminal & Fonts
cask "font-fira-code-nerd-font"
cask "cmux"

# Password Manager & VPN
cask "1password"
cask "1password-cli"
cask "tailscale"

# Productivity
cask "notion"
cask "raycast"
cask "setapp"

# Development IDEs
cask "cursor"
cask "claude"
cask "bruno"
cask "gitkraken"
cask "datagrip"
cask "docker"
cask "docker-desktop"
cask "antigravity"
cask "antigravity-ide"

# BI & Data
cask "tableau"
cask "superset"

# Office
cask "microsoft-excel"

# Browser
cask "google-chrome"

# =============================================================================
# App Store Apps (managed by mas)
# =============================================================================

# Uncomment if you want App Store apps managed by brew
# mas "Xcode", id: 497799835
